In [57]:
import pandas as pd
df = pd.read_csv('agora.csv')

In [58]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [59]:
df.shape

(50, 5)

# Robust Scaler

In [60]:
from sklearn.preprocessing import RobustScaler

In [61]:
r = RobustScaler()

In [62]:
r_fit = r.fit(df[['Marketing Spend']])

In [63]:
r_fit

RobustScaler()

In [64]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [65]:
df['Marketing Spend'] = r.transform(df[['Marketing Spend']])

In [66]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.672530       136897.80  471784.10    Dhaka  192261.83
1         1.452113       151377.59  443898.53      Ctg  191792.06
2         1.303634       101145.55  407934.54  Rangpur  191050.39
3         1.156567       118671.85  383199.62    Dhaka  182901.99
4         1.119836        91391.77  366168.42  Rangpur  166187.94

In [67]:
df.Administration = r.transform(df[['Administration']])

In [68]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.672530        1.035356  471784.10    Dhaka  192261.83
1         1.452113        1.270164  443898.53      Ctg  191792.06
2         1.303634        0.455588  407934.54  Rangpur  191050.39
3         1.156567        0.739799  383199.62    Dhaka  182901.99
4         1.119836        0.297418  366168.42  Rangpur  166187.94

In [69]:
df.Transport = r.transform(df[['Transport']])

In [70]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.672530        1.035356   6.465966    Dhaka  192261.83
1         1.452113        1.270164   6.013766      Ctg  191792.06
2         1.303634        0.455588   5.430563  Rangpur  191050.39
3         1.156567        0.739799   5.029455    Dhaka  182901.99
4         1.119836        0.297418   4.753272  Rangpur  166187.94

In [71]:
df.columns

Index(['Marketing Spend', 'Administration', 'Transport', 'Area', 'Profit'], dtype='object')

In [72]:
df = df.drop(['Area','Profit'],axis=1)

In [73]:
df.head()

   Marketing Spend  Administration  Transport
0         0.672530        1.035356   6.465966
1         1.452113        1.270164   6.013766
2         1.303634        0.455588   5.430563
3         1.156567        0.739799   5.029455
4         1.119836        0.297418   4.753272

In [97]:
#one
import pandas as pd
df2 = pd.read_csv('agora.csv')

In [98]:
df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [99]:
x = df2.drop(['Profit'],axis=1)
y = df2['Profit']

In [103]:
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

In [104]:
x.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [106]:
new_x = df2.drop(['Area','Profit'],axis=1)

In [107]:
new_x.head()

   Marketing Spend  Administration  Transport
0        114523.61       136897.80  471784.10
1        162597.70       151377.59  443898.53
2        153441.51       101145.55  407934.54
3        144372.41       118671.85  383199.62
4        142107.34        91391.77  366168.42

In [108]:
new_x = r.fit_transform(new_x)

In [109]:
df.head()

   Marketing Spend  Administration  Transport
0         0.672530        1.035356   6.465966
1         1.452113        1.270164   6.013766
2         1.303634        0.455588   5.430563
3         1.156567        0.739799   5.029455
4         1.119836        0.297418   4.753272